---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeomCombinationSet
source: html/5236e432-78df-ce3e-28ce-5a1797339dd7.htm
---
# GeomCombinationSet Methods

Removes every item GeomCombination the set, rendering it empty.